{
  "config": {
    "imgPath": "assets/images/"
  },
  "meta": {
    "title": "Alex Beuscher : Portfolio and Resume",
    "author": "Alex Beuscher",
    "description": "Alex Beuscher is a web developer and entrepreneur living in Amesbury, MA. He has most recently worked as a web developer in California and is seeking opportunities in the cannabis space.",
    "keywords": "front end developer, web development amesbury",
    "site_url": "alexbeuscher.com",
    "site_thumb": "al_pic-lg.jpg",
    "permalink": "https://alexbeuscher.com/"
  },
  "header": {
    "name": "Alex Beuscher",
    "site_title": "Digital Marketing & Web Consulting",
    "nav": [
      {
        "text": "alexbeuscher@gmail.com",
        "url": "mailto:alexbeuscher@gmail.com"
      },
      {
        "text": "(617) 359-6971",
        "url": "tel:6173596971"
      }
    ]
  },
  "footer": {
    "legal": "© Alex Beuscher 2024",
    "nav": [
      {
        "text": "Github",
        "class": "icon-github",
        "url": "https://github.com/abeuscher/portfolio"
      },
      {
        "text": "LinkedIn",
        "class": "icon-linkedin",
        "url": "https://www.linkedin.com/in/alex-beuscher-8314157/"
      }
    ]
  },
  "overview": {
    "title": "overview",
    "intro_header": "Overview",
    "intro": "I have more than twenty years of experience working in marketing. I have originated digital campaigns, worked with stakeholders on high profile web properties, and managed several small teams to success. I also have experience as a storyteller, voice over artist, and video producer. I enjoy working with other people to create new and entertaining things - be they ad campaigns, products, or experiences."
  },
  "services": [
    {
      "header": "Digital Marketing Strategy Development",
      "content": "Crafting a marketing strategy that aligns with both your business goals and the needs of the people who will implement it. My focus is on creating sustainable, adaptable marketing strategies that consider your team's dynamics and the flexibility needed in an evolving market.",
      "scope": "Initial consultations, a comprehensive strategy document, and a follow-up session to review and adjust.",
      "totalhours": 40,
      "hourlyrate": 150,
      "estimatedcost": 6000
    },
    {
      "header": "Vendor Management & Outsourcing Consultation",
      "content": "Building strong relationships with vendors is essential for long-term success. I help you find and vet partners who align with your business values, ensuring open communication and a smooth handoff to those who will execute the work. The focus is on avoiding lock-in with proprietary systems, choosing decentralized, standards-based options where possible.",
      "scope": "Vendor search, recommendations, and communication management until the project starts.",
      "totalhours": 25,
      "hourlyrate": 150,
      "estimatedcost": 3750
    },
    {
      "header": "Web Presence Assessment & Strategy",
      "content": "Your web presence is more than just a digital storefront—it's how your business interacts with its audience. I conduct a thorough audit of your site and digital channels, focusing on usability, SEO, and scalability, then provide a clear roadmap for improvement. The goal is to build a resilient web presence that grows with your business.",
      "scope": "Web audit, 1-hour presentation of findings, and a roadmap for improvements.",
      "totalhours": 30,
      "hourlyrate": 150,
      "estimatedcost": 4500
    },
    {
      "header": "Digital Transformation Consulting",
      "content": "Helping businesses adopt modern, decentralized digital tools for long-term growth. Whether it's an eCommerce platform, CMS, or CRM, my approach is rooted in open standards to avoid vendor lock-in and ensure scalability. We'll work together to choose the right tools and make sure they integrate seamlessly into your existing operations.",
      "scope": "Digital tools assessment, strategy document, implementation plan, and follow-up sessions.",
      "totalhours": 50,
      "hourlyrate": 150,
      "estimatedcost": 7500
    },
    {
      "header": "Marketing Campaign Direction",
      "content": "Marketing campaigns should evolve with the market. My role is to create an adaptable, people-centered campaign strategy, ensuring alignment with your brand values and flexibility to pivot based on ongoing results. I'll oversee the execution by third-party vendors, making sure your team and the external partners work in harmony.",
      "scope": "Initial campaign strategy document, regular check-ins, and final performance report.",
      "totalhours": 35,
      "hourlyrate": 200,
      "estimatedcost": 7000
    },
    {
      "header": "Web Development Oversight",
      "content": "Managing the development of secure, standards-based web solutions, I focus on projects that prioritize open systems, scalability, and the long-term resilience of your business. I ensure that everything from frontend to backend is implemented using best practices and designed for future growth.",
      "scope": "Project oversight, code reviews, and ensuring delivery aligns with your business goals.",
      "totalhours": 45,
      "hourlyrate": 180,
      "estimatedcost": 8100
    },
    {
      "header": "Technology Integration & Automation",
      "content": "Automating business processes and integrating new technology should be a seamless experience. I help identify the right systems, focusing on decentralized, open platforms to ensure flexibility and avoid vendor lock-in. Together, we'll implement solutions that grow with your business and improve operational efficiency.",
      "scope": "Tech assessment, integration plan, and oversight of implementation.",
      "totalhours": 60,
      "hourlyrate": 180,
      "estimatedcost": 10800
    }
  ],
  "packages": [
    {
      "header": "Foundations Package",
      "content": "Best for early-stage businesses or those looking for foundational digital marketing strategies without oversaturation in the market. This package focuses on businesses that need to establish a clear, strategic digital presence in a market where options are limited.",
      "scope": "Digital Marketing Strategy Development and Web Presence Assessment & Strategy",
      "totalhours": 50,
      "hourlyrate": 150,
      "estimatedcost": 7500
    },
    {
      "header": "Growth & Differentiation Package",
      "content": "Best for mid-stage businesses or those in oversaturated markets looking to stand out and scale through smart digital strategies. For businesses struggling with differentiation in crowded markets, this package offers comprehensive digital and marketing strategies designed to help them carve out a unique space.",
      "scope": "Marketing Campaign Direction, Vendor Management & Outsourcing Consultation, and Web Development Oversight",
      "totalhours": 70,
      "hourlyrate": 165,
      "estimatedcost": 9450
    },
    {
      "header": "Budget Essentials Package",
      "content": "Best for businesses with limited budgets but looking to get the most out of their digital presence and marketing efforts. This is a more affordable option for businesses that may not be able to afford comprehensive packages but still need help with core aspects of their digital marketing and web presence.",
      "scope": "Digital Marketing Strategy Development and Web Presence Assessment",
      "totalhours": 30,
      "hourlyrate": 150,
      "estimatedcost": 4500
    }
  ]
}
