{
  "config": {
    "imgPath": "assets/images/"
  },
  "meta": {
    "title": "Alex Beuscher - Digital Marketing & Web Consulting",
    "author": "Alex Beuscher",
    "description": "Alex Beuscher is a web developer and entrepreneur living in Amherst, MA. He has most recently worked as a web developer in California and is seeking opportunities primarily in the non-profit sector.",
    "keywords": "front end developer, web development amherst",
    "site_url": "alexbeuscher.com",
    "site_thumb": "al_pic-lg.jpg",
    "permalink": "https://alexbeuscher.com/"
  },
  "header": {
    "name": "Al Beuscher",
    "title": "Digital Marketing & Web Development",
    "nav": [
      {
        "text": "Services",
        "url": "/",
        "key": "home"
      },
      {
        "text": "Portfolio",
        "url": "/portfolio/",
        "key": "portfolio"
      },
      {
        "text": "Voiceover",
        "url": "/voiceover/",
        "key": "voiceover"
      }
    ]
  },
  "case_studies": [
    {
      "title": "Marketing Analytics Optimization",
      "company": "Dynamic Signal",
      "location": "San Bruno, CA",
      "key_metrics": [
        {
          "label": "Load time reduction",
          "value": "14s → 2.5s"
        },
        {
          "label": "Conversion rate",
          "value": "100% increase"
        },
        {
          "label": "Time on page",
          "value": "2x improvement"
        },
        {
          "label": "Organic traffic",
          "value": "45% growth"
        }
      ],
      "content": "<p>At Dynamic Signal, I inherited a bloated WordPress installation that had accumulated technical debt through multiple agency handoffs. We had no source control, no analytics, and no strategy.</p><p>I rebuilt the theme using modern practices, eliminated unnecessary front-end plugins, and implemented version control. My team then worked with our stakeholders to identify key performance indicators that actually mattered to the business. By focusing our optimization efforts on these core metrics rather than trying to improve everything at once, we were able to demonstrate clear ROI.</p><p>The result was not just technical improvement but a shift in how the organization approached web analytics. The marketing team was able to make data-driven decisions without getting lost in excessive metrics, leading to more effective campaigns and better resource allocation.</p>"
    },
    {
      "title": "Technical Leadership & Debt Reduction",
      "company": "Contentstack",
      "location": "San Diego, CA",
      "key_metrics": [
        {
          "label": "Codebase reduction",
          "value": "50%"
        },
        {
          "label": "Development speed",
          "value": "200% faster"
        },
        {
          "label": "Team size",
          "value": "6 junior developers"
        },
        {
          "label": "Project completion rate",
          "value": "3x improvement"
        }
      ],
      "content": "<p>At Contentstack, I was tasked with improving the output of a junior development team in Mumbai while overhauling the site development process. The stack we worked with was the company's core product - an enterprise headless CMS in combination with Gatsby.</p><p>I used several different approaches to working with this team, including pair programming, general presentations on best practices, and regular one on ones.</p><p>A lot of what was needed here was context; when working with teams in multiple time zones, it is easy to lose the overall goals of a project. By regularly meeting with stakeholders and team members, I made sure that each individual understood their role and the role of the team as a whole. This allowed the team to move with greater agility and to feel more confident when making decisions on their own. The result was a significantly leaner codebase, and more activated productive employees.</p>"
    },
    {
      "title": "Healthcare AI Innovation & Open Source Advocacy",
      "company": "HIE of One",
      "location": "Arlington, MA",
      "key_metrics": [
        {
          "label": "Development timeframe",
          "value": "6 months part-time"
        },
        {
          "label": "Core deliverable",
          "value": "Application Development"
        },
        {
          "label": "Additional Deliverables",
          "value": "Website redesign, Social media presence"
        },
        {
          "label": "Tech stack",
          "value": "Vue.js, AI Integration"
        }
      ],
      "content": "<p>At HIE of One, I contributed to an open source healthcare initiative focused on patient data sovereignty and AI integration. </p><p>I developed a one page application called MAIA or Medical AI Assistant. MAIA ia a Vue.js application demonstrating how patient-controlled health records can safely leverage AI capabilities while maintaining privacy and regulatory compliance. The app serves as a proof of concept for healthcare providers considering open source alternatives to traditional EHR systems. Alongside this development work, I rebuilt <a href='https://hieofone.com/' target='_blank'>the organization's website</a> with new messaging that helped to articulate the technical and ethical foundations of the project.</p><p>While still in its early stages, the project has attracted interest from healthcare researchers in both the US and India.</p>"
    },
    {
      "title": "Enterprise Content Strategy Transformation",
      "company": "2K Games",
      "location": "Novato, CA",
      "key_metrics": [
        {
          "label": "Systems consolidated",
          "value": "5 → 1"
        },
        {
          "label": "Languages supported",
          "value": "12"
        },
        {
          "label": "Annual content updates",
          "value": "3,000+"
        },
        {
          "label": "Cost reduction",
          "value": "60%"
        }
      ],
      "content": "<p>At 2K Games, I led the transition from agency-dependent web properties to a unified, in-house content management system. The challenge was maintaining high-quality content across multiple game franchises while supporting global localization needs.</p><p>By implementing a headless CMS architecture and establishing clear content workflows, we created a system that dramatically reduced publishing time while improving content quality. The system was so effective it became the standard for other departments and continues to serve as the foundation for 2K's web presence today.</p><p>We were able to leverage an open source product - an early API based CMS named Cockpit - and to hire the product's lead developer to add localization support with the help of my team. I was very pleased to have been able to both leverage and help pay for open source while in this role, and it is a goal for me to do this more often in future. As a regular contributor to open source, I think it is often the best, lowest cost choice for organizations over the long term, and when all things are equal I find open source to almost always be the best solution.</p>"
    }
  ],
  "multimedia": {
    "intro": "I have been involved in film and audio production for about 15 years. My initial foray into the field was as a line producer on an independent film. I worked as a DJ and MC for 10 years following, hosting pub trivia as well as weddings and other events.",
    "experience": "When I moved into radio, I worked as a content producer and video production comprised about 50% of my time. I had a small team whom I coordinated to film interviews, live events, concerts, and in studio sketches. Since then I have been employed on and off as a voiceover artist in multiple scenarios. I am specifically skilled at production, voiceover, and web integration, but I also can edit, film, and engineer audio at an amateur level.",
    "audio": [
      {
        "src": "audio/audiosample_bernies.mp3",
        "type": "audio/mpeg",
        "title": "Bernie & Phil's Commercial",
        "description": "Commercial spot for Bernie & Phil's furniture store"
      },
      {
        "src": "audio/audiosample_clintonsavings.mp3",
        "type": "audio/mpeg",
        "title": "Clinton Savings Bank",
        "description": "Commercial spot for Clinton Savings Bank"
      },
      {
        "src": "audio/audiosample_ge.mp3",
        "type": "audio/mpeg",
        "title": "General Electric",
        "description": "Commercial spot for General Electric"
      },
      {
        "src": "audio/audiosample_intuit.mp3",
        "type": "audio/mpeg",
        "title": "Intuit",
        "description": "Commercial spot for Intuit software"
      },
      {
        "src": "audio/audiosample_preph.mp3",
        "type": "audio/mpeg",
        "title": "Pre-Ph Commercial",
        "description": "Pre-Ph product commercial spot"
      },
      {
        "src": "audio/audiosample_robitussin.mp3",
        "type": "audio/mpeg",
        "title": "Robitussin",
        "description": "Commercial spot for Robitussin medicine"
      },
      {
        "src": "audio/audiosample_starbucks.mp3",
        "type": "audio/mpeg",
        "title": "Starbucks",
        "description": "Commercial spot for Starbucks Coffee"
      },
      {
        "src": "audio/audiosample_suffolk.mp3",
        "type": "audio/mpeg",
        "title": "Suffolk University",
        "description": "Commercial spot for Suffolk University"
      },
      {
        "src": "audio/audiosample_tonightoncbs.mp3",
        "type": "audio/mpeg",
        "title": "CBS Programming",
        "description": "Tonight on CBS programming promo"
      },
      {
        "src": "audio/audiosample_wilburcomedy.mp3",
        "type": "audio/mpeg",
        "title": "Wilbur Comedy",
        "description": "Wilbur Theatre comedy show promo"
      }
    ],
    "video": [
      {
        "url": "https://www.youtube.com/watch?v=M1GukNhzugM",
        "title": "HIE Demo Video",
        "description": "Demonstration video for HIE of One, an open source medical records initiative. I scripted, recorded, and did the video piece as well."
      },
      {
        "url": "https://www.youtube.com/watch?v=rGOYeoeXtWI",
        "title": "WAAF Highlight Reel",
        "description": "A collection of clips from my time in radio."
      }
    ]
  },
  "philosophy": {
    "header": "My Philosophy",
    "content": "<p>My guiding philosophy in tech is to keep solutions as simple as possible and do more listening than talking. In any consulting interaction I need to learn your whole business problem before I can solve anything. And the best solution is always to improve current tools rather than replace them.</p><p>Too often as a dev or volunteer tech, I have seen flashy vendors fleece non-profit and for-profit organizations alike with panacea technology. The reality is there is no panacea and to say otherwise would be hugely dishonest; an organization needs to have a good framework and also a good follow through. Blogs don't write themselves. Calendars don't auto-populate. In other words, part of helping you solve your problems is making sure that we work together to create sustainable technology practices which grow stronger over time through repetition and self-evaluation.</p>"
  },
  "contact": {
    "intro": "Please reach out with any questions. I am always happy to help."
  },
  "footer": {
    "legal": "© Alex Beuscher 2025",
    "nav": [
      {
        "text": "Github",
        "class": "icon-github",
        "url": "https://github.com/abeuscher/"
      },
      {
        "text": "LinkedIn",
        "class": "icon-linkedin",
        "url": "https://www.linkedin.com/in/alex-beuscher-8314157/"
      }
    ]
  }
}
